// MakeQCT.cpp : Defines the entry point for the console application.
//
#include "stdafx.h"

#include "OziGen.h"
#include "OziGenDlg.h"

#include <windows.h>
#include <stdio.h>
#include "MakeQCT.h"

#include "IGN.h"
#include "OSPro.h"
#include "NGI.h"

#include "TileDatabase.h"
#include "Database.h"

#include <io.h>
#include <sys/stat.h>
#include <fcntl.h>
#include "../MapLib/zconf.h"
#include "../MapLib/zlib.h"
#include "../MapLib/palette.h"
#include "qct.h"
#include "qctcoef.h"
#include "../MapLib/mmmath.h"

#include "../MapLib/Lambert93.h"


#include "ProgressWindow.h"
#include "func.h"

extern CoordinateSystems g_CoordinateSystem;

unsigned char MakeQCT_ign_palette[1024] = {
	0xFE, 0xFE, 0xFE, 0xFF, 0xFE, 0x00, 0xFE, 0xFF, 0xFE, 0x32, 0x00, 0xFF, 0xFE, 0x7F, 0x00, 0xFF, 
	0xFE, 0xD8, 0xB2, 0xFF, 0xFE, 0xFE, 0x00, 0xFF, 0xFE, 0xFE, 0x65, 0xFF, 0x00, 0xFE, 0x00, 0xFF, 
	0x4B, 0xFE, 0x65, 0xFF, 0x00, 0xFE, 0x54, 0xFF, 0x3F, 0xFE, 0x7F, 0xFF, 0xB9, 0xFE, 0xD0, 0xFF, 
	0xD0, 0xFE, 0xDF, 0xFF, 0x00, 0xFE, 0xFE, 0xFF, 0x4B, 0x98, 0xFE, 0xFF, 0x7F, 0x98, 0xE5, 0xFF, 
	0x32, 0x00, 0xFE, 0xFF, 0x00, 0x00, 0x00, 0xFF, 0xF8, 0xF8, 0xF8, 0xFF, 0xF2, 0xF2, 0xF2, 0xFF, 
	0xEC, 0xEC, 0xEC, 0xFF, 0xE6, 0xE6, 0xE6, 0xFF, 0xE0, 0xE0, 0xE0, 0xFF, 0xDA, 0xDA, 0xDA, 0xFF, 
	0xD4, 0xD4, 0xD4, 0xFF, 0xCE, 0xCE, 0xCE, 0xFF, 0xC8, 0xC8, 0xC8, 0xFF, 0xC2, 0xC2, 0xC2, 0xFF, 
	0xBC, 0xBC, 0xBC, 0xFF, 0xB6, 0xB6, 0xB6, 0xFF, 0xB0, 0xB0, 0xB0, 0xFF, 0xAA, 0xAA, 0xAA, 0xFF, 

//		read_png(y*1000, x*1000, &db, bitmap_offset + (maxy-5-y)*height*bitmap_width+(x-minx)*width, bitmap_width);
		tilewidth = 40;
	} else if (nMapScale == MAP_SCALE_MS) {
//		read_png(y*1000, x*1000, &db, bitmap_offset + (maxy-20-y)*height*bitmap_width+(x-minx)*width, bitmap_width);
		tilewidth = 10;
	}

	unsigned char	palette_convert[256];
	unsigned char * tracklog_palette = get_tracklog_palette();
	int i;
	for (i=0; i<256; i++)
		palette_convert[i] = (unsigned char)RGBtoPalette(mm_osgb_palette, 128, tracklog_palette[i*4+0], tracklog_palette[i*4+1], tracklog_palette[i*4+2]);

	for (y=0; y < tilewidth/2; y++) {
		for (x=0; x<tilewidth; x++) {
			// Flip image in the Y axis and convert to the 128 colour memory map palette
			unsigned char t = palette_convert[bitmap_offset[x+y*bitmap_width]];
			bitmap_offset[x+y*bitmap_width] = palette_convert[bitmap_offset[x+(tilewidth-1-y)*bitmap_width]];
			bitmap_offset[x+(tilewidth-1-y)*bitmap_width] = t;
		}
	}
	return 0;
}

int QCT_IGN_read_bmp(long northing, long easting, CIGNTileDatabase * db, unsigned char * bm_ptr, long bitmap_width)
{
	// load file
	long tileSize=0;
	LPBYTE data = db->ReadTile(northing*1000, easting*1000, &tileSize);
	if (data == NULL) {
		// white tile = palette entry 0
		for (long ty=0; ty<TILE_WIDTH; ty++)
			memset(bm_ptr+ty*bitmap_width, 0, TILE_WIDTH);
		return 1;		// couldn't load file
	}
//	char strTilename[256];
//	sprintf(strTilename, "%d-%d\r", easting, northing);
//	printf("%s\r", strTilename);

	unsigned char * bmp = (unsigned char *)malloc(161078);
	if (bmp == NULL) {
		free(data);
		printf("Couldn't allocate 161078 bytes for bitmap\n");
		return 1;
	}


	// decode zlib encoded data

	int ret;
	z_stream strm;

	/* allocate inflate state */
	strm.zalloc = Z_NULL;
	strm.zfree = Z_NULL;
	strm.opaque = Z_NULL;
	strm.avail_in = 0;
	strm.next_in = Z_NULL;
	ret = inflateInit(&strm);
	if (ret != Z_OK) {
		free(bmp);
		free(data);
		return ret;
	}

	strm.avail_in = tileSize;
	strm.next_in = data;
	strm.avail_out = 161078;
	strm.next_out = bmp;
	ret = inflate(&strm, Z_NO_FLUSH);
	(void)inflateEnd(&strm);

	if (memcmp(bmp+0x36, MakeQCT_ign_palette, 0x400) != 0) {
		printf("tile %d %d has a different palette\n", easting, northing);
	}

	unsigned char	palette_convert[256];
	int i;
	for (i=0; i<256; i++)
		palette_convert[i] = (unsigned char)RGBtoPalette(mm_ign_palette, 128, bmp[0x36+i*4+0], bmp[0x36+i*4+1], bmp[0x36+i*4+2]);

/*
	FILE * fp = fopen("out.bmp", "wb+");
	fwrite(bmp, 1,161078, fp);
	fclose(fp);
*/
	long y,x;
	for (y=0; y < TILE_WIDTH; y++) {
		for (x=0; x<TILE_WIDTH; x++) {
			bm_ptr[x+y*bitmap_width] = palette_convert[bmp[y*TILE_WIDTH+x+0x436]];
		}
	}

	free(bmp);
	free(data);
	return 0;
}

/////////////////////////////////////////////////////////////////////////////
// The one and only application object

long compress(unsigned char * data, unsigned char * output);
long compressHuffman(unsigned char * data, unsigned char * output);
long compressHuffmanTest(unsigned char * data, unsigned char * output);

#pragma pack(push,1)
	struct smsg_hdr {
		unsigned long length;		// 0
		unsigned long unknown1;		// 4
		unsigned short type;		// 8
		unsigned long id;			// 0x0a
		unsigned long unknown2[2];	// 0x0e
		unsigned short revision;	// 0x16
		unsigned short unknown3[3];	// 0x18
//		unsigned short unknown3[3+14];	// 0x18
		unsigned long width;		// 0x1e
		unsigned short unknown4[3];	// 0x22
		unsigned long height;		// 0x28
		unsigned short unknown5[3];	// 0x2c
		unsigned long format;		// 0x32
		unsigned short unknown6;	// 0x36
		unsigned long palette_size;	// 0x38
		unsigned char palette[1024];// 0x3c
		unsigned short unknown7;	// 0x43c
		unsigned long raster_size;	// 0x43e
		unsigned char raster[1];	// 0x442
	};
#pragma pack(pop)


#define CHECK_ERR(err, msg) { \
    if (err != Z_OK) { \
        fprintf(stderr, "%s error: %d\n", msg, err); \
        exit(0); \
    } \
}


int MakeQCT_abortProgram = FALSE;

BOOL MakeQCT_CtrlCHandler(DWORD dwCtrlType)
{
	MakeQCT_abortProgram = TRUE;
	return TRUE;
}

int MakeQCT_compare_palettes(const void * palette1, const void * palette2, int palette_len)
{
const DWORD * pal1 = (DWORD*)palette1;
const DWORD * pal2 = (DWORD*)palette2;
	palette_len >>= 2;
	while (palette_len--) {
		if ((*pal1 & 0xffffff) != (*pal2++ & 0xffffff))
			return 0;
	}
	return 1;
}



struct sQCT	qct_header;

void writePoint(int fh_qct, long x, long y)
{
	double lat, lon;

	switch (g_CoordinateSystem) {
	case COORD_BELGIUM_LAMBERT_2008:
		LambertBelgium2008ToWGS84(y*1000, x*1000, &lat, &lon);
		break;
	case COORD_FRANCE_LAMBERT_1993:
		Lambert93ToWGS84(y*1000, x*1000, &lat, &lon);
		break;
	case COORD_OSGB:
	default:
